import Link from 'next/link'
import React from 'react'

const Terms = () => {
  return (
    <section className='bg-black w-full h-full flex justify-center text-lg py-10'>
      <div className='h-full max-w-4xl'>
      <div className='pb-10'>
        <Link href="/">
          <img src={'/svg/skelya_logo.svg'} alt='' className='h-[42px] lg:h-[56px]'/>
        </Link>
      </div>  
      <h1 className='text-white text-center text-4xl font-bold mb-5 font-unbounded'>Умови Використання <br/> (Terms & Conditions)</h1>
      <div className='text-white-02 flex flex-col gap-5 pb-10'>
        <div className='flex flex-col gap-2'>
          <b className='text-xl font-unbounded'>1. Введення: </b>
          Ці Умови Використання створюють правові рамки взаємовідносин між ФОП Мельник Вʼячеслав Олександрович (далі “Компанія”), який веде діяльність під брендом “СКЕЛЯ”, та користувачами сайту [наш веб-сайт]. Вони визначають права та обов’язки користувачів, а також умови надання послуг, що включають розбір резюме, допомогу у створенні профілю LinkedIn, консультації з пошуку роботи та розробку кар’єрних планів.
        </div>

        <div className='flex flex-col gap-2'>
          <b className='text-xl font-unbounded'>2. Обов’язки Користувача: </b>
          Користувачі зобов’язуються використовувати платформу виключно у законний спосіб. Це означає надання достовірної інформації, утримання від дій, що можуть вважатися незаконними або шкідливими для інших осіб, та дотримання всіх застосовних законів та правил.
        </div>

        <div className='flex flex-col gap-2'>
          <b className='text-xl font-unbounded'>3. Оплата Послуг: </b>
          Послуги надаються на підставі повної передоплати. Оплата можлива через банківські перекази або за допомогою кредитних карток Visa, MasterCard. Оплата вважається здійсненою після підтвердження транзакції банком чи платіжною системою.
        </div>

        <div className='flex flex-col gap-2'>
          <b className='text-xl font-unbounded'>4. Авторські Права та Інтелектуальна Власність: </b>
          Всі матеріали, опубліковані на сайті “СКЕЛЯ”, включаючи текстовий контент, графіку, логотипи, та інші елементи дизайну, є власністю Компанії або її партнерів та захищені чинним законодавством про авторські права та інтелектуальну власність. Будь-яке ненадане в Умовах використання використання цих матеріалів без дозволу Компанії суворо заборонено.
        </div>

        <div className='flex flex-col gap-2'>
          <b className='text-xl font-unbounded'>5. Відмова від Відповідальності: </b>
          Компанія докладає всіх зусиль для забезпечення точності та актуальності інформації на платформі, однак не може гарантувати абсолютної відсутності помилок. Компанія не несе відповідальності за будь-які збитки або втрати, що виникли внаслідок використання або неможливості використання інформації чи послуг на платформі.
        </div>

        <div className='flex flex-col gap-2'>
          <b className='text-xl font-unbounded'>6. Право на Зміну Умов: </b>
          Компанія має право в будь-який час змінювати Умови Використання, попереджаючи про це користувачів шляхом публікації оновленої версії Умов на сайті чи через електронну пошту.
        </div>

        <div className='flex flex-col gap-2'>
          <b className='text-xl font-unbounded'>7. Захист Даних: </b>
          Для захисту персональних даних користувачів Компанія використовує сучасні методи шифрування, системи фізичного та цифрового контролю доступу та регулярно оновлює програмне забезпечення для запобігання несанкціонованому доступу або витоку інформації.
        </div>

        <div className='flex flex-col gap-2'>
          <b className='text-xl font-unbounded'>8. Права та Обов’язки Користувачів:</b>
          Користувачі зобов’язані утримуватися від розміщення неправдивої інформації, реклами, використання образливої лексики та інших дій, що можуть порушувати права інших осіб або шкодити репутації Компанії.
        </div>

        <div className='flex flex-col gap-2'>
          <b className='text-xl font-unbounded'>9. Права компанії</b>
          Компанія залишає за собою право:
          <ul className='flex flex-col gap-3'>
            <li>
              Змінити Сайт: Вносити будь-які зміни у дизайн, структуру, функціонал, а також вміст сайту на свій розсуд. Це включає, але не обмежується, оновленням інтерфейсу, додаванням нових функцій, інтеграцією з іншими сервісами.
            </li>
            <li>
              Змінювати вартість і види послуг: Оновлювати ціни, умови надання послуг, а також вводити нові види послуг або припиняти існуючі, забезпечуючи попереднє повідомлення користувачів у випадку істотних змін.
            </li>
            <li>
              Регулювати зовнішній вигляд оголошень: Модифікувати формат оголошень, використовуючи заголовки, марковані та нумеровані списки для підвищення читабельності та забезпечення послідовності презентації інформації.
            </li>
            <li>
              Редагувати або видаляти контент: Видаляти або редагувати матеріали, опубліковані користувачами на сайті, якщо вони порушують умови цієї Угоди, завдають шкоди репутації Компанії чи третім особам, або ж якщо вони вважаються недоречними за власним розсудом Компанії.
            </li>
            <li>
              Оновлювати Угоду: Вносити зміни в цю Угоду в односторонньому порядку. Користувачі будуть проінформовані про змінені умови з моменту їх опублікування на сайті. Користувачам рекомендується регулярно переглядати Угоду для ознайомлення з актуальними змінами.
            </li>
            <li>
              Оновлювати Угоду: Вносити зміни в цю Угоду в односторонньому порядку. Користувачі будуть проінформовані про змінені умови з моменту їх опублікування на сайті. Користувачам рекомендується регулярно переглядати Угоду для ознайомлення з актуальними змінами.
            </li>
            <li>
              Моніторинг та Модерація: Моніторити активність на сайті та модерувати вміст для забезпечення дотримання правил користування та умов поведінки.
            </li>
            <li>  
              Обмеження доступу: Обмежувати або припиняти доступ користувачів до сайту у випадку порушення цих Умов, або з міркувань безпеки та стабільності платформи.
            </li>
            <li>
              Використання зворотного зв’язку: Використовувати відгуки, коментарі та пропозиції користувачів для поліпшення послуг, розвитку нових функцій та удосконалення користувацького досвіду.
            </li>
          </ul>
        </div>

      </div>
      <div className='flex justify-center'>
        <Link 
          className='w-full bg-purple-main px-10 py-5 text-black text-center text-3xl font-unbounded font-semibold' href='/'
        >
          На головну
        </Link>
      </div>
      </div>
    </section>
  )
}

export default Terms